[
  {
    "websiteName": "Ricardo",
    "recipeUrl": "https://www.ricardocuisine.com/recettes/8210-b-uf-braise-avec-salade-d-herbes",
    "title": "Bœuf braisé avec salade d’herbes",
    "recipeInfo": {
      "preparationTimeInMs": 1500000,
      "cookTimeInMs": 4500000,
      "portions": 4
    },
    "ingredients": {
      "Bœuf": [
        "1,1 kg (2 1/2 lb) de rôti de palette de bœuf désossé et dégraissé au besoin, coupé en 6 morceaux égaux",
        "30 ml (2 c. à soupe) d’huile végétale",
        "750 ml (3 tasses) de bouillon de bœuf réduit en sel",
        "1 oignon rouge, émincé",
        "2 échalotes françaises, émincées",
        "2 gousses d’ail, hachées",
        "1 morceau de gingembre frais de 5 cm (2 po), tranché",
        "1 tige de citronnelle de 10 cm (4 po), coupée en trois",
        "2 piments oiseaux rouges",
        "15 ml (1 c. à soupe) de sauce soya",
        "15 ml (1 c. à soupe) de sauce aux huîtres"
      ],
      "Salade d’herbes": [
        "25 g (1/2 tasse) de coriandre, ciselée",
        "10 g (1/4 tasse) de basilic thaï, ciselé",
        "10 g (1/4 tasse) de menthe, ciselée",
        "2 oignons verts, émincés",
        "2 gousses d’ail, hachées finement",
        "1 piment oiseau rouge, épépiné et haché finement",
        "5 ml (1 c. à thé) de zeste de lime",
        "30 ml (2 c. à soupe) de jus de lime",
        "Quartiers de lime, pour le service"
      ]
    },
    "steps": {
      "Bœuf": [
        "Dans l’autocuiseur à feu élevé, dorer les morceaux de viande dans l’huile sur toutes les faces. Saler et poivrer. Réserver sur une assiette.",
        "Ajouter le reste des ingrédients et porter à ébullition en remuant. Remettre la viande dans l’autocuiseur.",
        "Fermer l’appareil et amener à pression. Réduire la température à feu moyen (ou juste assez pour maintenir la pression) et poursuivre la cuisson 45 minutes. Retirer du feu et laisser retomber la pression d’elle-même ou refroidir l’autocuiseur sous l’eau froide avant d’ouvrir. Dans le cas d’un autocuiseur électrique, presser la valve pour faire sortir la vapeur avant d’ouvrir.",
        "Ouvrir l’autocuiseur. Retirer la viande et réserver sur une assiette. Au-dessus d’une poêle, passer la sauce au tamis. Jeter les aromates. À feu élevé, réduire la sauce jusqu’à ce qu’elle épaississe, soit environ 10 minutes. Remettre les morceaux de viande dans la sauce et bien les enrober."
      ],
      "Salade d’herbes": [
        "Dans un bol mélanger tous les ingrédients.",
        "Garnir le bœuf de la salade d’herbes. Servir avec du riz et accompagner de quartiers de lime."
      ]
    },
    "recipeImgUrl": "https://images.ricardocuisine.com/services/recipes/500x675_8210.jpg"
  },
  {
    "websiteName": "Ricardo",
    "recipeUrl": "https://www.ricardocuisine.com/recettes/3011-filets-de-porc-glaces-a-l-erable",
    "title": "Filets de porc glacés à l'érable",
    "recipeInfo": {
      "preparationTimeInMs": 900000,
      "cookTimeInMs": 1200000,
      "portions": 6
    },
    "ingredients": [
      "Farine",
      "2 filets de porc de 450 g (1 lb) chacun",
      "15 ml (1 c. à soupe) de beurre",
      "15 ml (1 c. à soupe) d'huile végétale",
      "4 échalotes françaises, hachées",
      "15 ml (1 c. à soupe) de moutarde  de Dijon",
      "125 ml (1/2 tasse) de sirop d'érable"
    ],
    "steps": [
      "Placer la grille au centre du four. Préchauffer le four à 180 °C (350 °F).",
      "Fariner les filets de porc. Dans une poêle allant au four, à feu moyen-élevé, dorer les filets de porc dans le beurre et l'huile. Saler et poivrer. Réserver sur une assiette.",
      "Dans la même poêle, attendrir les échalotes. Ajouter la moutarde, le sirop d'érable et laisser mijoter 1 minute, jusqu'à ce que la sauce épaississe. Remettre les filets de porc dans la poêle et bien les enrober de la sauce.",
      "Cuire au four de 16 à 17 minutes, pour une cuisson rosée.",
      "Retirer du four et couvrir de papier d'aluminium. Laisser reposer 5 minutes avant de trancher. Décorer de thym frais.",
      "Accompagner de pilaf d'orge aux lardons et/ou de purée de courge poivrée à l'érable."
    ],
    "recipeImgUrl": "https://images.ricardocuisine.com/services/recipes/500x675_3011.jpg"
  },
  {
    "websiteName": "Trois fois par jour",
    "recipeUrl": "https://www.troisfoisparjour.com/fr/recettes/plats-principaux/poulet-volaille/poulet-a-la-moutarde-herbes-fraiches-riz-a-la-ciboulette/",
    "title": "Poulet à la moutarde, herbes fraiches & riz à la ciboulette ",
    "recipeInfo": {
      "preparationTime": 1200000,
      "cookTime": 1,
      "portions": null
    },
    "ingredients": [
      "1 c. à soupe d’huile végétale",
      "10 hauts de cuisse de poulet, désossés",
      "Sel et poivre",
      "2 tasses de poireau, coupé en deux et émincé finement",
      "2 gousses d’ail, hachées",
      "1/2 tasse de vin blanc",
      "3/4 de tasse de bouillon de poulet",
      "1 c. à soupe de moutarde à l’ancienne",
      "1 c. à soupe de moutarde de Dijon",
      "1-2 c. à soupe d’estragon frais, haché",
      "1/2 tasse de crème 35 %",
      "2 c. à soupe de beurre",
      "1/2 tasse d’oignon jaune, haché finement",
      "Sel et poivre, au goût",
      "1 tasse de riz blanc à grains longs",
      "2 tasses de bouillon de poulet",
      "2 c. à soupe de ciboulette, hachée finement"
    ],
    "steps": [
      "Préchauffer le four à 325 °F.",
      "Dans une grande poêle, chauffer l’huile à feu vif et saisir les hauts de cuisse afin de colorer la peau. Assaisonner et transférer les pièces de poulet dans un plat allant au four, le côté avec la peau vers le haut.",
      "Dans la même poêle, ajouter le poireau et l’ail, puis faire revenir pendant 5 minutes à feu moyen.",
      "Déglacer au vin blanc, puis bien gratter le fond de la poêle avec une cuillère en bois.",
      "Ajouter le reste des ingrédients, bien mélanger, assaisonner généreusement et verser sur le poulet.",
      "Enfourner pendant 45 minutes.",
      "Pendant ce temps, faire fondre le beurre dans une casserole et attendrir l’oignon pendant 5 minutes. Assaisonner.",
      "Ajouter le riz, puis bien mélanger afin de l’enrober de beurre. Ajouter le bouillon de poulet et porter à ébullition.",
      "Baisser le feu, puis poursuivre la cuisson pendant 15 minutes, ou jusqu’à ce que le riz ait complètement absorbé le bouillon.",
      "Ajouter la ciboulette, bien mélanger et servir avec le poulet. "
    ],
    "recipeImgUrl": "https://tfpj-s3.troisfoisparjour.com/app/uploads/2018/08/19212300/PouletmoutardeL-718x1024.jpg"
  }
]